{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"11a66976-e19e-50d7-867b-dd3350849b61","excerpt":"I thought I could finally start to post some articles I had on paper but when I received a feed from the Phil. Daily Inquirer about the brawl at a golf club…","html":"<p>I thought I could finally start to post some articles I had on paper but when I received a feed from the Phil. Daily Inquirer about the brawl at a golf club where Bambee De la Paz’s family was playing just a few days ago, I knew I had to post this first . To be frank, I was not even shocked. You hear this daily from all sorts of people of how the powerful take themselves as Gods. That all rules (written or not) don’t apply to them. That the lives of us mere mortals are nothing but … well nothing. But to read from a first hand account of it is more than infuriating . I feel I could just grab the perpetrator’s necks and twist them till I’m satisfied. Even more spectacularly numbing to me is that the club attendants did not even try to help. Enough of what I feel go to the link below and decide for yourself.</p>\n<p>Bloggers all around please support the Dela Paz family. Pray that Lady Justice wont be so kind to these BULLIES. Below is Bambee de la Paz’s post on the events of that day.</p>\n<p><a href=\"http://vicissitude-decidido.blogspot.com/2008/12/world-is-fucked-up.html\">http://vicissitude-decidido.blogspot.com/2008/12/world-is-fucked-up.html</a></p>\n<p><span style=\"font-style:italic;\">Added Note: The damn a–holes pummeled the De la Paz patriarch and his son twice.<br /></span></p>","frontmatter":{"title":"Valley Golf Bullies","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008-12-30-/","previous":{"fields":{"slug":"/2009-02-04-/"},"frontmatter":{"title":"Sleepers: Christmas Party Edition"}},"next":{"fields":{"slug":"/2008-01-19-/"},"frontmatter":{"title":"CPK New Year Lunch"}}}}