{"data":{"site":{"siteMetadata":{"title":"CodeSpud"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"If you work with Linux or Unix-like operating systems like Ubuntu or the MacOS, you might be familiar with Bourne-Again Shell or [BASH][1] for short. This article will show you that with a little elbow grease, you can have your BASH prompt work for you and heck maybe have a little fun with it.\n\nPeople tell me the invention of the GUI (graphical user interface) is the best thing that ever happened to modern computing. I beg to differ. Not all work is accomplished through the GUI nor is it efficient.  \n","fields":{"slug":"/make-bash-prompt-work/"},"frontmatter":{"date":"November 14, 2016","title":"Make Your Bash Prompt Work For You","featured_image":"assets/2016/11/mybashpromot_in_action.png"}}},{"node":{"excerpt":"I&#8217;ve got some leeway pushing <a title=\"Khrunus\" href=\"https://github.com/chrisbautista/Khrunus\" target=\"_blank\">Khrunus</a> off the ground.  I&#8217;ve always been successful using JavaScript&#8217;s timing functions but since Khrunus would primarily be built-in in AngularJS. I have to research a way to reuse my timing snippets into proper Angular code.  To study, I built a simple angular app:\n\n## Problem\n\nHow to use AngularJS to make a time related app, in this case a timer for logging elapsed time?\n\n## What I need\n\nBefore I started this little venture, I need to detail the parameters of the experiment.\n\nFirstly,  I need to layout my application in two sections. The top section will show a digital clock face and a button to toggle(start or stop) the clock. The bottom section will be a table showing start and end times, as well as the total duration. ","fields":{"slug":"/how-to-make-a-timer-stopwatch-using-angularjs/"},"frontmatter":{"date":"September 28, 2014","title":"How To Make A Timer/Stopwatch Using AngularJS","featured_image":"/assets/2014/09/angular-featured.png"}}},{"node":{"excerpt":"I had a struck of inspiration earlier this week. I&#8217;ve always wanted to make this webapp that has been playing in my mind  for a while and I finally had some ideas to start on.  Of course, like any of my projects, the first thing I do is research.  First in my list was a workflow to streamline development. It&#8217;s been a while since I modified my workflow and so I thought it was time for a change.\n\nAside from the design and flow of the application, my immediate concern was where to host my apps once I&#8217;m done with the first milestone. I was researching around the interweb and a familiar link caught my eye.  Heroku was the 2nd link of my search. I investigated Heroku when I first made a Facebook application for Lowe Philippines.  I remember seeing a link to Heroku from Facebook&#8217;s &#8220;Create App&#8221; wizard. Back then I was more curious than impressed. Anyway, this time I was very curious but now I&#8217;m also very impressed with how Heroku made it easy to deploy an app. Heroku does not magically build a scaffold for you but it does guide you through steps in their &#8220;Getting started&#8221; page and heck it&#8217;s free.  \n","fields":{"slug":"/quick-and-free-way-to-set-up-your-app-using-heroku/"},"frontmatter":{"date":"April 20, 2014","title":"Quick and Free Way to Set Up Your App using Heroku","featured_image":"assets/2014/08/features-tools-3dc022115028973bfa824eb354f1d87c.png"}}},{"node":{"excerpt":"When I started blogging again last September, I was delighted to get a template with built-in message polling to twitter. I played with it a bit and settled with the look you see at the right. I am not a prolific &#8216;twitterer&#8217;, but I love the whole concept of [micropublishing][1].\n\n","fields":{"slug":"/install-twitter-search-widget/"},"frontmatter":{"date":"October 19, 2009","title":"Install Twitter Search Widget","featured_image":null}}},{"node":{"excerpt":"It started with <a href=\"http://tinyurl.com/\" target=\"_blank\">TinyURL</a>, <a href=\"http://en.wikipedia.org/wiki/URL_shortening\" target=\"_blank\">URL aliasing/shortening</a> has become big business with similar sites growing out of the woodwork(See <a href=\"http://en.wikipedia.org/wiki/URL_shortening\" target=\"_blank\">URL Shortening &#8211; History</a>). With other unrelated services following the trend, like <a href=\"http://scr.im/\" target=\"_blank\">scr.im</a>(email aliasing) and <a href=\"http://twt.fm/\" target=\"_blank\">twt.fm</a>(promotes music), adding value to support our slowly growing twittering society. Bit.ly is one such revolutionary child; [but this child has grown big enough to even rival TinyURL][1].\n\n","fields":{"slug":"/bit-ly-a-simple-url-shortener/"},"frontmatter":{"date":"October 17, 2009","title":"bit.ly, a simple url shortener","featured_image":null}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"limit":5,"skip":0,"numPages":5,"currentPage":1}}