{"data":{"site":{"siteMetadata":{"title":"CodeSpud"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Lightweight jQuery Plugin to transform links containing images into quick previews. See project page for examples. Install Download files. Copy boxer.js, boxer.css, and close.png into your project Include boxer.js and boxer.css Enclose target anchors in a container e.g.  Run code…","fields":{"slug":"/boxerjs/"},"frontmatter":{"date":"March 02, 2015","title":"BoxerJS","featured_image":"/boxerjs_codespud.png"}}},{"node":{"excerpt":"Surf, in celebration of it’s anniversary, is thanking it’s customers with “American Idol”-ish contest. Participants are asked to send in a story, a photo or a video telling Surf why they are Surf’s biggest fan. Are you Surf’s Biggest Fan? Then prove it! tell us with a story, a…","fields":{"slug":"/surf-biggest-fan/"},"frontmatter":{"date":"March 02, 2015","title":"Surf : Biggest Fan","featured_image":"/surf-biggest-fan-facebook-app.png"}}},{"node":{"excerpt":"You Scent It! is a promotional Facebook application by Lewis and Pearl. Participants must choose among a number different scents and design themes in the You Scent It App and come up with a thoughtful, heartwarming message for their loved ones. Tell someone how you feel with the…","fields":{"slug":"/lewis-and-pearl-you-scent-it/"},"frontmatter":{"date":"February 18, 2015","title":"Lewis and Pearl: You Scent It!","featured_image":"/you-scent-it-facebook-promo.png"}}},{"node":{"excerpt":"Self  is an award winning IOS app by AWARE foundation of Singapore. Most women do not complain about domestic violence (verbal and physical) because they have no evidence to prove it. This app, when activated, monitors for a spike in the ambient sound decibel level (for example…","fields":{"slug":"/self-aware/"},"frontmatter":{"date":"August 29, 2014","title":"Self : AWARE","featured_image":"/self-app-for-aware-foundation.png"}}},{"node":{"excerpt":"Go Nuts Donuts - ConstrucTables are tables up-cycled for fun and utility: The Bike Table:\nBike tables let you have your donut and burn calories too with its reconfigured pedals from old bicycles and a calorie counter to track what you’ve burned. The Drum Table:\nRecord your own…","fields":{"slug":"/construc-tables/"},"frontmatter":{"date":"August 28, 2014","title":"Go Nuts : Constructables","featured_image":"/constructables-website.png"}}},{"node":{"excerpt":"The Plana FORMA App allows you to schedule and register for classes at the Plana FORMA studios of your choice. You can also view promos and announcements. Plana FORMA™ created by Julie Alagde, draws inspiration from her extensive experiences in dance, pilates, yoga, sports and…","fields":{"slug":"/plana-forma/"},"frontmatter":{"date":"August 13, 2014","title":"Plana Forma","featured_image":"/plana_forma_mobile_app.png"}}},{"node":{"excerpt":"Billy barks so your phone bills don’t bite. Download Billy for free and start tracking your mobile usage. Billy uses your phone’s own logs for SMS, talk minutes, and data. It then computes costs according to preset rates, which you can customize. You can also tell Billy when you…","fields":{"slug":"/billy-phone-usage-app/"},"frontmatter":{"date":"August 13, 2014","title":"Billy","featured_image":"/billy_mobile_usage_app.png"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false}}