{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"e5793f4b-80a3-519e-a4a8-83c1daa079f9","excerpt":"Dear Angel,  Its my first day without you. I hope your well out there in Budapest. Dont worry about your family I ’ ll try check on them every chance I get. As…","html":"<p>Dear Angel, </p>\n<p>Its my first day without you. I hope your well out there in Budapest. Dont worry about your family I’ll try check on them every chance I get. As for me I’m a wreck without you. It took half an hour of staring to void before I realized Im hungry and need to make me some breakfast.I spent another 2 hours scrubbing the fan grills(I have two of them you know). I scrubbed so much the fan lit brighter than my table lamp :). I need to get a hobby. I dont know how to spend all this free time. </p>\n<p><a href=\"http://photos1.blogger.com/blogger/1732/2122/1600/200602251544_00035.0.jpg\"><img style=\"float:right; margin:0 0 10px 10px;cursor:pointer; cursor:hand;\" src=\"http://photos1.blogger.com/blogger/1732/2122/200/200602251544_00035.jpg\" border=\"0\" alt=\"off to the airport\"></a>Sundays was always spent doing some chores in the morning and spending lunch and most of the afternoon, mocking TV shows and their hosts. Or watching a real tear jerker Or just cuddling, spending idle time in each others company. But now, Im all by my lonesome , wondering what to do. 🙂 I was tempted to go to bed early. Hoping that it’s Monday so I can get busy with work and not miss you so much. </p>\n<p>Anyway, dont worry I can manage another day like this. 🙁</p>\n<p>Just take care of yourself and come back to me soon. I love you! </p>\n<p>Missing you,<br>\nPotato</p>","frontmatter":{"title":"A Day Far from You (Open Letter)","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2006-02-27-/","previous":{"fields":{"slug":"/2008-01-19-/"},"frontmatter":{"title":"CPK New Year Lunch"}},"next":{"fields":{"slug":"/2006-02-07-/"},"frontmatter":{"title":"Complete"}}}}