{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"e99e00d6-99bb-52f4-bcd9-4ec27c3296d6","excerpt":"Argh! ! * &^#( * @(*! It ’ s past 8pm. I need to get going or Karen is going to kill me.  I ’ m almost finish with this module  –  I just have to save this to…","html":"<blockquote>\n<p>Argh! !*&#x26;^#(*@(*!</p>\n<p>It’s past 8pm. I need to get going or Karen is going to kill me. </p>\n<p>I’m almost finish with this module – I just have to save this to my external hard drive then I can work on it some more over the weekend. </p>\n<p>Double Argh!! @*$@%@&#x26;!% ! </p>\n<p>I can’t find my external HD. D–m! Must have left it at home. Note to myself : eat some brain food – losing too much brain cells. Now what do I do!? </p>\n<p>I cant burn it to a DVD (that would take forever) and emailing an archive is out of the question. Then it hit me – a while back I installed Dropbox after reading it from a <a href=\"http://lifehacker.com/397778/dropbox-syncs-and-backs-up-files-between-computers-instantaneously\" target=\"_blank\">Lifehacker post</a>. With a free 2GB account I can upload the files and the latest backup easy. Later I just have to install the client in my home PC and the sync should be automatic. </p>\n<p>I quickly checked my program files. Great! Haven’t uninstalled yet. I open the app. Then copied the files to my designated local dropbox folder. After a minute I see the check icon and done. I kill my workstation, took my stuff and went down to parking. 🙂 I met with Karen with some time to spare. My life is saved!!</p>\n</blockquote>\n<p>I apologize for the dramatics. Its a little exaggerated but that’s really how I come to appreciate this awesome web app. </p>\n<p><a name='more'></a><br>\n<span></p> </p>\n<div style=\"text-align:center;\">\n  <a href=\"http://www.getdropbox.com/tour\" target=\"_blank\"><img alt border=\"0\" src=\"http://2.bp.blogspot.com/_BBS5bkzuLXM/SqTW_soN5dI/AAAAAAAACcs/-Kk6Oy9_Lh8/s320/tour_1.jpg\"></a>\n</div>\n<p>\n  Dropbox is a storage provider maintained by Everflow Inc. Anyone can register and get 2 gigabytes of Dropbox webspace to play with. It&#8217;s not a new wheel but heck it&#8217;s free and suprisingly robust. You even have an opportunity to increase your account&#8217;s capacity up to 3 gigabytes by inviting others to get their own accounts. Setting up is a breeze, you need to install a small <a href=\"http://www.getdropbox.com/downloading\" target=\"_blank\">client</a> to handle syncing your local and remote Dropbox folders. After installation, the client will ask you to login your myDropbox account or register for a new one. Login and choose a folder to sync (or just use the default setting) &#8211; and that&#8217;s that. You now have a simple backup system to keep your mind at ease. Its not just some place you upload files to. <span style=\"display: inline;\">The whole system sports a number of features such as a revision history and a means to collaborate files. </span>\n</p>\n<p>\n  Everyone has their own way in keeping their precious files safe and readily available. Dropbox just extends it a bit further with some cool features and for casual users &#8211; its free. The only thing i see the client lacking is a means to monitor multiple dropbox folders &#8211; not just one. But all in all I love my Dropbox account and highly recommend it to anyone.\n</p>\n<p>\n</p>\n<blockquote>\n  <p>\n    <b>Rating</b>\n  </p>\n  \n  <p>\n    4 stars : <b>Installation</b>\n  </p>\n  \n  <p>\n    5 stars : <b>Interface</b>\n  </p>\n  \n  <p>\n    4 stars : <b>Ease of use</b>\n  </p>\n</blockquote>\n<p>\n  If you need more information, take their quick <a href=\"http://www.getdropbox.com/tour\" target=\"_blank\">tour</a>.\n</p>\n<p>\n  <em><span style=\"font-size: x-small;\">Image copied from the Dropbox site.</span></em>\n</p>\n<p>\n  </span>\n</p>","frontmatter":{"title":"Dropbox : Lifesaver?","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-09-07-/","previous":{"fields":{"slug":"/2009-01-01-/"},"frontmatter":{"title":"Time for New Year Lists"}},"next":{"fields":{"slug":"/2009-08-29-/"},"frontmatter":{"title":"Site Map"}}}}