{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"a7e7697c-e6db-5432-b913-0365b7f0c142","excerpt":"Lord Jesus, I sit here this morning with a heart that is breaking, knowing that many of your people are in pain and are struggling this day. I know I am not…","html":"<blockquote>\n<p>Lord Jesus, I sit here this morning with a heart that is breaking, knowing that many of your people are in pain and are struggling this day. I know I am not alone in my own personal struggles. I am finding a very real center of your peace falling around me, and I pray that same peace for my struggling brothers and sisters.. I know that pain and struggle are a part of this fallen world in which we live. I know that until the day of Your return there will continue to be pain. But I also know that in the midst of that pain and suffering, I see the extended hands of my Savior reaching ours from His heavenly dwelling place, calling to me, and to all who struggle. </p>\n<p>excerpt: Prayer for Hard Times – Prayer through Pain <a href=\"http://www.allaboutreflections.org/prayer-for-hard-times.htm\" target=\"_blank\">allaboutreflections.com</a></p>\n</blockquote>\n<p><a name='more'></a></p>\n<p>I got this cartoon from an email that a close friend sent.</p>\n<div style=\"clear: both; text-align: center;\">\n  <img border=\"0\" height=\"2212\" src=\"http://dl.getdropbox.com/u/1510515/potatokorner/www.potatokorner.co.cc-lords-protection.jpg\" width=\"300\"><br>src: anonymous\n</div>\n<p><em>I have no idea who made the cartoon – if anyone knows please leave me a message and I’ll change the credits.</em></p>","frontmatter":{"title":"Lord’s Protection","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-09-30-/","previous":{"fields":{"slug":"/2009-02-07-/"},"frontmatter":{"title":"How do I love thee?"}},"next":{"fields":{"slug":"/2009-09-27-/"},"frontmatter":{"title":"Stranded in the Wake of Ondoy (Ketsana)"}}}}