{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"0ee52555-b3c7-532b-96ea-18dba5f5e591","excerpt":"A  lot of people , us included, got stranded yesterday (September 26, 2009 PH Time) after constant rains flooded most of the metro. With the absence of an…","html":"<div style=\"clear: both; text-align: center;\">\n  <a style=\"margin-left: 1em; margin-right: 1em;\" href=\"http://lh4.ggpht.com/_BBS5bkzuLXM/Sr7m_jFP17I/AAAAAAAADGo/z39LMTTFiuY/s1600/Picture%20158.jpg\"><img src=\"http://lh4.ggpht.com/_BBS5bkzuLXM/Sr7m_jFP17I/AAAAAAAADGo/z39LMTTFiuY/s320/Picture%20158.jpg\" border=\"0\" alt></a> <br>Tried to get as much contrast, you still cant see everything.<br>At the back, a house with the first floor submerged in flood water\n</div>\n<p><span style=\"float: left; font-size: 60px; margin: 2px;\">A</span> lot of people , us included, got stranded yesterday (September 26, 2009 PH Time) after constant rains flooded most of the metro. With the absence of an official warning from news or similar sources, we continued our plans that day – not knowing what will become of us by late afternoon. We ignored the constant rains, we even ignored the heavy flood we met on Laloma (street in Manila) – and just decided to plan another trip next week. We were confident we won’t meet the same fate, as our homes (or the way we take to go home), never gets flooded. We reached SM North EDSA by 10am, and decided to eat lunch. We parked the car at SM Annex as our favorite parking place is closed to traffic.</p>\n<p><strong>Time: 11:45 am</strong></p>\n<p>After a nice hour or so eating pizza and catching up with Karen’s mom (she just got home from a year – long stay in Canada). We were off to the movies. We had to cross a foot bridge to get to the main building where the theaters are. I almost got knocked back by the strong winds when we stepped out of the exit and into the bridge. By this time, I got alarmed – I almost asked Karen if we can cancel everything and just return home. But shrugged it off as well, when I saw how many people are coming into the mall. These many people can’t be that stupid to go out in a really big storm.<br>\n<a name=\"more\"></a><br>\nWe got our movie tickets – the movie starts at 1:45pm – we have time to kill. I remembered Mama Alda (Karen’s mom) wanting to check out microwave ovens, so i suggested we go to the appliance store which is in the basement floor. Lo – behold , the basement floor is knee deep in water. Guess what, we ignored that as well. We rationalized that the nearby construction site for a condominium project messed up with the drainage system. The movie starts in a couple of minutes – so we went in and just prayed the day will get better after the movie.</p>\n<p><strong>Time: 1:40 pm</strong></p>\n<p>The movie was a real tear-jerker ( Karen is a sucker for drama pictures ) , and believe me I saw tears flooding in the theater (as if floods outside aren’t enough). It ended with a weird ending and some applause. I got excited, finally, we can go home and wait out the rains in safety. After a quick stop at the grocer, we crossed the bridge(the winds are a little less intimidating now) and into the parking area to get the car.</p>\n<p><strong>Time: 5:12 pm</strong></p>\n<p>After a while of driving we reached some congestion on our usual route. I don’t even remember how I did it but I got the car on the main road. There’s still some light then, so things are looking up, or so I thought. On the main road, traffic came to a stop – complete Newton’s-First-Law stop. It’s been an hour now and we’ve only managed to move an inch or so. Cars have started to counter flow – but I stood my ground and stuck with keeping with the traffic rules. After another 30 mins of waiting, I gave in and followed other drivers spilling out to incoming traffic. In a couple of minutes we saw the cause of the stand still. Water has risen in an alarming rate – covering half a car. Some good people tried to help the trapped cars by breaking the dividing wall to let the water escape to the other side. A lot of vehicles have parked their cars on higher ground. Their passengers alighting the vehicles, joining the people on foot – refusing to spend the night on the road. Even large vehicles like trucks that can cross the waters are waiting as well since more cars have decided not to continue – blocking their only route. We forged on, optimistic that the road we took will straighten soon.</p>\n<div style=\"clear: both; text-align: center;\">\n  <a style=\"margin-left: 1em; margin-right: 1em;\" href=\"http://lh5.ggpht.com/_BBS5bkzuLXM/Sr7nBE_S9AI/AAAAAAAADGs/ZTbz-AWqJio/s1600/Picture%20159.jpg\"><img src=\"http://lh5.ggpht.com/_BBS5bkzuLXM/Sr7nBE_S9AI/AAAAAAAADGs/ZTbz-AWqJio/s320/Picture%20159.jpg\" border=\"0\" alt></a><br>My girl keeping her humor intact\n</div>\n<p><strong>Time : 7:45 pm</strong> </p>\n<p>Less than a hundred meters – and yet it took us almost 2 hours. We wormed our way through inch by inch. We had some short breaks in the deadlock when some people would volunteer to do what traffic enforcers should be doing. I almost forgot to add, out of all the deputized officials in MMDA or the city government – i did not find a single one managing the roads. It’s selfish of me to expect too much – but isn’t that their jobs. I pray that they’re busy doing nobler causes than helping a few hundred people get home. I apologize for the outburst – its just the frustration talking.</p>\n<p>Finally, we got through that mess – I thought the worst was over. But I got burned the third time again today. The subdivision we live in is the highest point in the Bagbag Area, but the single road access is beside a creek where most of the water in the area drains to Valenzuela, another municipality bordering Bulacan. The creek never overflowed before so imagine our surprise. Bulacan is a major province of the Philippines, if you’re from the Philippines and like me, you follow the local news, you should have heard of an incident related to this flooding. A while back, I found an article, more like a warning from PhilVocs (Philippine Institute of Volcanology and Seismology) addressed to the province’s executives. Read the report <a href=\"http://www.philstar.com/Article.aspx?articleId=506772\" target=\"_blank\">here</a>. Anyway, they were warned that cracks, which were confirmed by natives living around the dam, were found in critical parts of the structure; which can cause the dam to break – in the right(/worse) conditions. They contested the report and they assured the public that these conditions are close to impossible. Adding the dam, forty plus years old, passed Japanese standards – as if there’s magic saying those words. I mentioned the dam because, the sudden rise in water level was caused by the dam releasing water. I think fearing it would break – and make PhilVolcs predictions true. Shame on you! *(!@#&#x26;@#$</p>\n<p><strong>Time: 8:15pm</strong></p>\n<p>Back to our story, not being able to cross the rising water we opted to park the car near the road. High enough so the water would not reach it – at least that’s what we pray. I tried to call my brother but the lines were busy – fortunately the sms network is still intact. I got text messages from my bro asking if we’re affected by the flood. Thank God he’s okay. I told him we’re still waiting for the water to go down – enough for the car to cross. He replied again that he will be staying at my youngest sibling’s place and try to get home to our father in the morning. My father lives in our hometown of Valenzuela. I hope my father’s all right.</p>\n<p>Good thing we had some food intended for “pasalubong” (gift) to Karen’s relatives left at home. Waiting that long, we resorted to consuming the bag of fast food. Never savored spaghetti so much. After a while, some women knocked on the window. They were offering some warm coffee, since we already ate and had our fill of soda, we graciously declined. They moved to the other cars lined up on the same street. I smiled – there are still some good people out there after all. I left the car for 10 mins, to check whether the water started receding or is still rising. I got into talking with some of the residents. They said they have lived here for 30 years and never have they experienced a flood – being higher than most places in Metro Manila. Sitting cross-legged on the pavement, holding a large umbrella like a tent, a middle-aged woman added the house opposite us – is their house. They left everything they had to escape to where we are. A “baranggay tanod”(a local enforcer), came crossing the water carrying some items he rescued for the family. I only saw a streak of red at first, more than half his body submerged in water but soon his silhouette cleared. He told someone at the shore that it may take longer than expected. The water is still rising fast. I returned to the car, explained the situation to Karen. I came out again after 15 minutes and everytime with some more info. I took out my camera and tried to shoot into the pitch black night – intending to show them the extent of the flood. I got really crappy pictures as power is down and no decent lighting can reinforce my point-n-shoot. I did those trips a couple more times – the last time, I saw the water has gone down significantly. Some large vehicles like trucks and four-wheel drives braved the still alarmingly high water.</p>\n<div style=\"clear: both; text-align: center;\">\n  <a style=\"margin-left: 1em; margin-right: 1em;\" href=\"http://lh3.ggpht.com/_BBS5bkzuLXM/Sr7m9MZYLUI/AAAAAAAADGk/M2wwGCxby94/s1600/Picture%20157.jpg\"><img src=\"http://lh3.ggpht.com/_BBS5bkzuLXM/Sr7m9MZYLUI/AAAAAAAADGk/M2wwGCxby94/s320/Picture%20157.jpg\" border=\"0\" alt></a><br>People escaping from the rising flood.\n</div>\n<p><strong>Time: 11:08 pm</strong></p>\n<p>Thirty more minutes, the flood waters have cleared enough, I was confident we can cross. I immediately started the car and followed a taxi cab who had the same idea. We still felt the water pushing the car, I almost believed that we’d stall right there. Good-ole Badong did not fail on us – we reached the other end safely. We arrived at the house at quarter past 12, the power is still down. We steadied our nerves with a warm meal. And went straight to bed , hoping that our loved ones are okay.</p>\n<p>The six hours we waited in the rain was nothing compared to how long people waited – and for some, waiting still- for their houses to clear from water. We would never have experienced such an ordeal if we kept home. The only good thing I got from all this – is a renewed faith in the goodness of people. I have only gratitude for these people. For that man who faced the rain to straighten out the traffic jam. For the big guys who took a hammer and broke the wall so the waters can escape. For the coffee ladies, leaving the warmth of their houses to offer warmth to stranded people like us. And finally, for the brave “tanod”, that swam through the flood to give a victim something of her home.</p>\n<p>Tonight, I have one more thing to thank God for, and more prayers for people who still needs help.</p>","frontmatter":{"title":"Stranded in the Wake of Ondoy (Ketsana)","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-09-27-/","previous":{"fields":{"slug":"/2009-09-30-/"},"frontmatter":{"title":"Lord’s Protection"}},"next":{"fields":{"slug":"/2009-09-25-/"},"frontmatter":{"title":"Baby Dancing to Beyonce’s Song"}}}}