{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"ce6c730d-53ab-5daf-8bf7-5067dd382714","excerpt":"I first met you in a time when I was content being just me. Single, independent  –  I was invincible. I am complete. Years of youth ’ s fears are over now …  I…","html":"<p>I first met you in a time when I was content being just me. Single, independent – I was invincible. I am complete. Years of youth’s fears are over now… I grew up I guess and I felt noone can hurt me .. not anymore. </p>\n<p>So I convinced myself your not that pretty, but seeing your smile seems to make me doubt everytime. Anyway, you’re Frans’ friend, “nde katalo”, I said to myself. But I know for some reason… someday .. you will mean much more to me than I can ever hope for.</p>\n<p>“I was invincible” … what a joke! 🙁</p>\n<p>Years passed by, I felt the world closing in on me. I lost all that confidence. Home is not what it used to be, work is hell. Everything’s a mess… independence has never been so painful. I joined the walking dead, alive but not living. Everyday the same old things, the same problems, same places,same people and same pain. I felt the routine a spiral, to where, I dont know. I was looking forward to the end of it.</p>\n<p>Then, out of God’s good grace, I bumped into you again. All the feelings I hid from you, once upon a time, came rushing, like a river bashing into a dam after a summer downpour. I invited you to a movie and dinner. We spent some time as friends and I was very happy. Those times came more often… more and more i spend with you.. I felt the load on my chest lighten . Even in July the sun seems to shine – brighter even. I knew then that Im falling for you. And I made you feel that the only way i know, in words. </p>\n<p>I want you to know that, You turned my life around, when you finally said those three words. I was so happy and happier still every day. </p>\n<p>I can never go wrong again, because for once in my life I am truly .. complete.</p>\n<p>I love you my Angel!</p>","frontmatter":{"title":"Complete","date":"Invalid date","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2006-02-07-/","previous":{"fields":{"slug":"/2006-02-27-/"},"frontmatter":{"title":"A Day Far from You (Open Letter)"}},"next":{"fields":{"slug":"/2006-02-14-/"},"frontmatter":{"title":"Happy Valentines!"}}}}